In [17]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### You are given two tables:
- users
- trades

Write a query to list the top 3 cities that had the most number of completed orders

In [18]:
%%sql
SELECT * FROM users LIMIT 10

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(101, 'Oslo', 'user101@example.com', datetime.datetime(2025, 7, 21, 13, 16, 46, 150030)),
 (102, 'Barcelona', 'user102@example.com', datetime.datetime(2025, 7, 22, 13, 16, 46, 150030)),
 (103, 'Amsterdam', 'user103@example.com', datetime.datetime(2025, 7, 23, 13, 16, 46, 150030)),
 (104, 'Sevilla', 'user104@example.com', datetime.datetime(2025, 7, 24, 13, 16, 46, 150030)),
 (105, 'Berlin', 'user105@example.com', datetime.datetime(2025, 7, 25, 13, 16, 46, 150030)),
 (106, 'Paris', 'user106@example.com', datetime.datetime(2025, 7, 26, 13, 16, 46, 150030))]

In [19]:
%%sql
SELECT * FROM trades LIMIT 10

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(1, 101, Decimal('49.99'), 10, 'impression', datetime.datetime(2025, 7, 21, 13, 16, 46, 154040)),
 (2, 102, Decimal('75.50'), 5, 'click', datetime.datetime(2025, 7, 22, 13, 16, 46, 154040)),
 (3, 102, Decimal('20.00'), 15, 'click', datetime.datetime(2025, 7, 23, 13, 16, 46, 154040)),
 (4, 104, Decimal('100.00'), 8, 'impression', datetime.datetime(2025, 7, 24, 13, 16, 46, 154040)),
 (5, 102, Decimal('60.25'), 20, 'click', datetime.datetime(2025, 7, 25, 13, 16, 46, 154040)),
 (6, 106, Decimal('33.33'), 12, 'impression', datetime.datetime(2025, 7, 26, 13, 16, 46, 154040)),
 (7, 101, Decimal('85.75'), 7, 'click', datetime.datetime(2025, 7, 27, 13, 16, 46, 154040)),
 (8, 102, Decimal('42.10'), 18, 'impression', datetime.datetime(2025, 7, 28, 13, 16, 46, 154040)),
 (9, 103, Decimal('55.55'), 9, 'click', datetime.datetime(2025, 7, 29, 13, 16, 46, 154040)),
 (10, 104, Decimal('99.99'), 11, 'impression', datetime.datetime(2025, 7, 30, 13, 16, 46, 154040))]

In [29]:
%%sql
SELECT u.city, COUNT(*) AS completed_orders
FROM trades t 
INNER JOIN users u
ON t.user_id = u.user_id
GROUP BY u.city
ORDER BY completed_orders DESC
LIMIT 3;

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Oslo', 13), ('Barcelona', 11), ('Paris', 8)]

In [ ]:
%%sql
-- in this case this solution also works because cities and users are both unique 
WITH common_cities AS(
    SELECT u.user_id, u.city,  COUNT(t.order_id) as total_orders
    FROM users u
    LEFT JOIN trades t 
    ON u.user_id = t.user_id
    GROUP BY u.user_id
    ORDER BY COUNT(t.order_id) DESC
)
SELECT city, total_orders FROM common_cities LIMIT 3;

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Oslo', 13), ('Barcelona', 11), ('Paris', 8)]